nnikolov3/betaflight/lib/main/RISCV_K210/drivers/include/riscv_k210_sysctl.h
/**
 * @brief       Abstruct PLL struct
 */
typedef struct _sysctl_general_pll
{
    uint32_t clkr : 4;
    uint32_t clkf : 6;
    uint32_t clkod : 4;
    uint32_t bwadj : 6;
    uint32_t pll_reset : 1;
    uint32_t pll_pwrd : 1;
    uint32_t pll_intfb : 1;
    uint32_t pll_bypass : 1;
    uint32_t pll_test : 1;
    uint32_t pll_out_en : 1;
    uint32_t pll_ckin_sel : 2;
    uint32_t reserved : 4;
} __attribute__((packed, aligned(4))) sysctl_general_pll_t;

/**
 * @brief       System controller object instanse
 */
extern volatile sysctl_t *const sysctl;

/**
 * @brief       Enable clock for peripheral
 *
 * @param[in]   clock       The clock to be enable
 *
 * @return      result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_clock_enable(sysctl_clock_t clock);

/**
 * @brief       Enable clock for peripheral
 *
 * @param[in]   clock       The clock to be disable
 *
 * @return      result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_clock_disable(sysctl_clock_t clock);

/**
 * @brief       Sysctl clock set threshold
 *
 * @param[in]   which           Which threshold to set
 * @param[in]   threshold       The threshold value
 *
 * @return      result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_clock_set_threshold(sysctl_threshold_t which, int threshold);

/**
 * @brief       Sysctl clock get threshold
 *
 * @param[in]   which       Which threshold to get
 *
 * @return      The threshold value
 *     - Other  Value of threshold
 *     - -1     Fail
 */
int sysctl_clock_get_threshold(sysctl_threshold_t which);

/**
 * @brief       Sysctl clock set clock select
 *
 * @param[in]   which       Which clock select to set
 * @param[in]   select      The clock select value
 *
 * @return      result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_clock_set_clock_select(sysctl_clock_select_t which, int select);

/**
 * @brief       Sysctl clock get clock select
 *
 * @param[in]   which  Which clock select to get
 *
 * @return      The clock select value
 *     - Other  Value of clock select
 *     - -1     Fail
 */
int sysctl_clock_get_clock_select(sysctl_clock_select_t which);

/**
 * @brief       Get PLL frequency
 *
 * @param[in]   pll     The PLL id
 *
 * @return      The frequency of PLL
 */
uint32_t sysctl_pll_get_freq(sysctl_pll_t pll);

/**
 * @brief       Get base clock frequency by clock id
 *
 * @param[in]   clock       The clock id
 *
 * @return      The clock frequency
 */
uint32_t sysctl_clock_get_freq(sysctl_clock_t clock);

/**
 * @brief       Reset device by reset controller
 *
 * @param[in]   reset       The reset signal
 */
void sysctl_reset(sysctl_reset_t reset);

/**
 * @brief       Enable the PLL and power on with reset
 *
 * @param[in]   pll     The pll id
 *
 * @return      Result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_pll_enable(sysctl_pll_t pll);

/**
 * @brief       Disable the PLL and power off
 *
 * @param[in]   pll     The pll id
 *
 * @return      Result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_pll_disable(sysctl_pll_t pll);

/**
 * @brief       Select DMA channel handshake peripheral signal
 *
 * @param[in]   channel     The DMA channel
 * @param[in]   select      The peripheral select
 *
 * @return      Result
 *     - 0      Success
 *     - Other  Fail
 */
int sysctl_dma_select(sysctl_dma_channel_t channel, sysctl_dma_select_t select);

/**
 * @brief       Set SPI0_D0-D7 DVP_D0-D7 as spi and dvp data pin
 *
 * @param[in]   en     Enable or not
 *
 * @return      Result
 *     - 0      Success
 *     - Other  Fail
 */
uint32_t sysctl_set_spi0_dvp_data(uint8_t en);

/**
 * @brief       Set io power mode
 *
 * @param[in]   power_bank          IO power bank
 * @param[in]   io_power_mode       Set power mode 3.3v or 1.8
 *
 * @return      Result
 *     - 0      Success
 *     - Other  Fail
 */
void sysctl_set_power_mode(sysctl_power_bank_t power_bank, sysctl_io_power_mode_t io_power_mode);

/**
 * @brief       get the frequency of CPU
 *
 * @return      The frequency of CPU
 */
uint32_t sysctl_cpu_get_freq(void);

/**
 * @brief       Set frequency of CPU
 * @param[in]   freq       The desired frequency in Hz
 *
 * @return      The actual frequency of CPU after set
 */
uint32_t sysctl_cpu_set_freq(uint32_t freq);

/**
 * @brief       Init PLL freqency
 * @param[in]   pll            The PLL id
 * @param[in]   pll_freq       The desired frequency in Hz

 */
uint32_t sysctl_pll_set_freq(sysctl_pll_t pll, uint32_t pll_freq);

/**
 * @brief       Enable interrupt
 */
void sysctl_enable_irq(void);

/**
 * @brief       Disable interrupt
 */
void sysctl_disable_irq(void);

/**
 * @brief       Get the time start up to now
 *
 * @return      The time of microsecond
 */
uint64_t sysctl_get_time_us(void);

/**
 * @brief       Get reset status
 *
 * @return      The status of reset
 */
sysctl_reset_enum_status_t sysctl_get_reset_status(void);

#ifdef __cplusplus
}
#endif

#endif /* _DRIVER_SYSCTL_H */
